Домашние инвестиции/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Домашние инвестиции/src/CommonModules/КурсыВалют/Module.bsl
#Область ПрограммныйИнтерфейс

// Код процедур и функций


//Загружает курсы валют с сайта ЦБ РФ на указанную дату.
// 
// Параметры:
//  ДатаЗагрузки - Дата - дата, на которую нужно загрузить курсы.
//
// Файл: ДомашниеИнвестиции/src/CommonModules/КурсыВалют/Module.bsl
Процедура ЗагрузитьКурсыВалют(НачалоПериода, КонецПериода) Экспорт
	
	Заголовок = "Загрузка курса валют";
	ГруппаОшибок = "Загрузка курсов валют";
	
	// 0. Подготовка: получаем список валют, для которых нужно загрузить курсы
	СписокВалютДляЗагрузки = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Валюта,
		|	Валюты.Код КАК ЦифровойКод
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Использовать = ИСТИНА
		|	И НЕ Валюты.ПометкаУдаления";
	// ВАЖНО: Убедитесь, что реквизит "Использовать" существует в справочнике.
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Заполняем соответствие, где ключ - цифровой код из справочника,
		// а значение - ссылка на элемент справочника
		СписокВалютДляЗагрузки.Вставить(Выборка.ЦифровойКод, Выборка.Валюта);
	КонецЦикла;
	
	Если СписокВалютДляЗагрузки.Количество() = 0 Тогда
		ОбработкаОшибокКлиент.СообщитьОписаниеОшибки(Заголовок, "В справочнике 'Валюты' не найдено элементов с установленным флагом 'Использовать'. Загрузка отменена.");
		Возврат;
	КонецЕсли;

	// 1. Основной цикл по датам в указанном периоде
	ТекущаяДата = НачалоПериода;
	ВсегоЗагружено = 0;
	
	Пока ТекущаяДата <= КонецПериода Цикл
		
		// 1.1. Определяем формат даты в зависимости от периода.
		// Для дат до 01.07.2010 используется формат "dd/MM/yyyy",
		// для более поздних - "dd.MM.yyyy".
		ГраницаФормата = Дата(2010, 7, 1);
		Если ТекущаяДата < ГраницаФормата Тогда
			ДатаФормат = Формат(ТекущаяДата, "ДФ=dd/MM/yyyy");
		Иначе
			ДатаФормат = Формат(ТекущаяДата, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		// 2. Формируем адрес для запроса для текущей даты
		АдресЗапроса = "http://www.cbr.ru/scripts/XML_daily.asp?date_req=" + ДатаФормат;
	
		// 3. Создаем HTTP-соединение и отправляем запрос для текущей даты
		Попытка
			HTTPСоединение = Новый HTTPСоединение("www.cbr.ru");
			HTTPЗапрос = Новый HTTPЗапрос("/scripts/XML_daily.asp?date_req=" + ДатаФормат);
			HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
			
			Если HTTPОтвет.КодСостояния <> 200 Тогда
				ОбработкаОшибокКлиент.СообщитьОбОшибке(Заголовок, "Сервер ЦБ РФ вернул ошибку за дату " + ТекущаяДата + ". Код: " + HTTPОтвет.КодСостояния);
				// Переходим к следующей дате в случае ошибки
				ТекущаяДата = ТекущаяДата + 86400; // Прибавляем 1 день в секундах
				Продолжить;
			КонецЕсли;
			
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
			
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОбработкаОшибокКлиент.СообщитьОбОшибке(Заголовок, "Ошибка при подключении к сайту ЦБ РФ за дату " + ТекущаяДата + ": " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке), ГруппаОшибок);
			// Переходим к следующей дате в случае ошибки
			ТекущаяДата = ТекущаяДата + 86400; // Прибавляем 1 день в секундах
			Продолжить;
		КонецПопытки;
		
		// 5. Подготавливаем набор записей для записи в регистр за текущую дату
		НаборЗаписей = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
		
		// 6. Парсим XML для текущей даты
		Попытка
			
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.Имя = "Valute" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					
					NumCode = ""; Номинал = ""; Значение = "";
					
					// Читаем дочерние узлы элемента Valute
					Пока ЧтениеXML.Прочитать() Цикл
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Valute" Тогда
							Прервать;
						КонецЕсли;
						
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
							ИмяЭлемента = ЧтениеXML.Имя;
							ЧтениеXML.Прочитать();
							ЗначениеЭлемента = СокрЛП(ЧтениеXML.Значение);
							
							Если ИмяЭлемента = "NumCode" Тогда
								NumCode = ЗначениеЭлемента;
							ИначеЕсли ИмяЭлемента = "Nominal" Тогда
								Номинал = ЗначениеЭлемента;
							ИначеЕсли ИмяЭлемента = "Value" Тогда
								Значение = ЗначениеЭлемента;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					// 7. Проверяем, нужна ли нам эта валюта
					НайденнаяВалюта = СписокВалютДляЗагрузки.Получить(NumCode);
					
					// Если валюта найдена в нашем подготовленном списке
					Если НайденнаяВалюта <> Неопределено И Номинал <> "" И Значение <> "" Тогда
						Курс = Число(СтрЗаменить(Значение, ",", "."));
						Кратность = Число(СтрЗаменить(Номинал, ".", ","));
						Попытка
							РегистрыСведений.КурсыВалют.ЗаписатьКурсВалюты(ТекущаяДата, НайденнаяВалюта, Курс, Кратность);
							ВсегоЗагружено = ВсегоЗагружено + 1;
						Исключение
							ОбработкаОшибокКлиент.СообщитьОбОшибке(Заголовок, СтрШаблон("Не удалось загрузить курс валюты с кодом %1 на дату %2 по причине: %3", NumCode, ТекущаяДата, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)), ГруппаОшибок);
						КонецПопытки;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			ЧтениеXML.Закрыть();
			
		Исключение
			ОбработкаОшибокКлиент.СообщитьОбОшибке(Заголовок, СтрШаблон("Ошибка при разборе XML от ЦБ РФ за дату %2 по причине: %3", ТекущаяДата, ОписаниеОшибки()), ГруппаОшибок);
		КонецПопытки;
		
		// Переходим к следующей дате
		ТекущаяДата = ТекущаяДата + 86400; // Прибавляем 1 день в секундах
		
	КонецЦикла;
	
	Сообщить(СтрШаблон("Загрузка курсов валют за период с %1 по %2 завершена. Всего загружено записей: %3", НачалоПериода, КонецПериода, ВсегоЗагружено), СтатусСообщения.Информация);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
